#==============================================================================
# ■ VXAce-RGSS3-38 精霊システム [Ver.1.1.0]             by Claimh
#------------------------------------------------------------------------------
# ・アクターごとに精霊をパートナーにすることができます。
# ・パートナーになるとパラメータ上昇、スキル習得など
#   (パートナーのパラメータ、特徴が加算されます)
# ・精霊はパートナーになっている状態で戦闘に参加することでレベルが上昇します
# ・精霊のデータはデータベース上のアクターとして作成してください。
#------------------------------------------------------------------------------
# ☆ Добавить духа
#  $game_party.add_spirit(ID_духа)
# ☆ Удалить духа
#  $game_party.remove_spirit(ID_духа)
#☆ Сделать духа партнёром
#  Spirits.add_partner(ID_актёра, ID_духа)
# ☆ Отвязать духа-партнёра
#  Spirits.remove_partner(ID_актёра, ID_духа)
# ☆ Изменить максимальное количество партнёров
#  $game_actors[ID_актёра].max_spirits = n
#==============================================================================

module Spirits
  AFNTY=[{0=>3}]; MAX=[1] # Не изменять
### Настройки духов ##########################################################
  # Духи ※ ID духа 0 запрещён
  SPIRIT_ACTOR = {
  # ID духа => ID актёра
    1  => 40,
    2  => 41,
    3  => 42,
    4  => 43,
    5  => 44,
    6  => 45,
    7  => 46,
    8  => 47,
    9  => 48,
    10  => 49,
    11  => 50,
    12  => 51,
    13  => 52,
    14  => 53,
    15  => 54,
    16  => 55,
    17  => 56,
    18  => 57,
    51  => 80,
    52  => 81,
    53  => 82,
    54  => 83,
    55  => 84,
    56  => 85,
    57  => 86,
    58  => 87,
    59  => 88,
    60  => 89,
    61  => 90,
    62  => 91,
    63  => 92,
    64  => 93,
    65  => 94,
    66  => 95,
    67  => 96,
    68  => 97,
  }


### Начальные настройки #######################################################
  # Духи, добавленные в начале
  # START_V = [ID_духа, …]
  START_V = []

  # Начальные партнёры
  #  (Примечание) Можно задавать только начальных членов партии и духов.
  # START_P = {ID_актёра => ID_духа, …}
  START_P = {}  #{1=>3, 2=>4, 3=>2, 4=>1}


### Настройка количества партнёров ############################################
  # Максимальное количество партнёров (начальное значение)
  # MAX[ID_актёра] = максимальное количество
  MAX[1] = 1


### Настройка совместимости ##################################################
  # Можно задать совместимость каждого актёра с каждым духом по 5-балльной шкале.
  #---------------------------------------------------
  #   5   : очень хорошо (бонус характеристик: ×1.5)
  #   4   : хорошо         (бонус характеристик: ×1.2)
  #   3   : обычно         (бонус характеристик: ×1.0)
  #   2   : плохо          (бонус характеристик: ×0.8)
  #   1   : очень плохо    (бонус характеристик: ×0.5)
  #   0   : нельзя сделать партнёром
  #---------------------------------------------------
  # [ID_актёра] = {ID_духа => совместимость, …}
  AFNTY[1] = {1=>3, 2=>3, 3=>3, 4=>3, 5=>3, 6=>3, 7=>3, 8=>3, 9=>3, 10=>3,
  11=>3, 12=>3, 13=>3, 14=>3, 15=>3, 16=>3, 17=>3, 18=>3, 19=>3, 20=>3,
  21=>3, 22=>3, 23=>3, 24=>3, 25=>3, 26=>3, 27=>3, 28=>3, 29=>3, 30=>3, 31=>3, 
  32=>3, 33=>3, 34=>3, 35=>3, 36=>3, 37=>3, 38=>3, 39=>3, 40=>3, 41=>3, 42=>3, 
  43=>3, 44=>3, 45=>3, 46=>3, 47=>3, 48=>3, 49=>3, 50=>3, 51=>3, 52=>3, 53=>3,
  54=>3, 55=>3, 56=>3, 57=>3, 58=>3, 59=>3, 60=>3, 61=>3, 62=>3, 63=>3, 64=>3,
  65=>3, 66=>3, 67=>3, 68=>3,}
  AFNTY[2] = {1=>3, 2=>3, 3=>3, 4=>3, 5=>3, 6=>3, 7=>3, 8=>3, 9=>3, 10=>3,
  11=>3, 12=>3, 13=>3, 14=>3, 15=>3, 16=>3, 17=>3, 18=>3, 19=>3, 20=>3,
  21=>3, 22=>3, 23=>3, 24=>3, 25=>3, 26=>3, 27=>3, 28=>3, 29=>3, 30=>3, 31=>3, 
  32=>3, 33=>3, 34=>3, 35=>3, 36=>3, 37=>3, 38=>3, 39=>3, 40=>3, 41=>3, 42=>3, 
  43=>3, 44=>3, 45=>3, 46=>3, 47=>3, 48=>3, 49=>3, 50=>3, 51=>3, 52=>3, 53=>3,
  54=>3, 55=>3, 56=>3, 57=>3, 58=>3, 59=>3, 60=>3, 61=>3, 62=>3, 63=>3, 64=>3,
  65=>3, 66=>3, 67=>3, 68=>3,}
  AFNTY[3] = {1=>3, 2=>3, 3=>3, 4=>3, 5=>3, 6=>3, 7=>3, 8=>3, 9=>3, 10=>3,
  11=>3, 12=>3, 13=>3, 14=>3, 15=>3, 16=>3, 17=>3, 18=>3, 19=>3, 20=>3,
  21=>3, 22=>3, 23=>3, 24=>3, 25=>3, 26=>3, 27=>3, 28=>3, 29=>3, 30=>3, 31=>3, 
  32=>3, 33=>3, 34=>3, 35=>3, 36=>3, 37=>3, 38=>3, 39=>3, 40=>3, 41=>3, 42=>3, 
  43=>3, 44=>3, 45=>3, 46=>3, 47=>3, 48=>3, 49=>3, 50=>3, 51=>3, 52=>3, 53=>3,
  54=>3, 55=>3, 56=>3, 57=>3, 58=>3, 59=>3, 60=>3, 61=>3, 62=>3, 63=>3, 64=>3,
  65=>3, 66=>3, 67=>3, 68=>3,}  
  AFNTY[4] = {1=>3, 2=>3, 3=>3, 4=>3, 5=>3, 6=>3, 7=>3, 8=>3, 9=>3, 10=>3,
  11=>3, 12=>3, 13=>3, 14=>3, 15=>3, 16=>3, 17=>3, 18=>3, 19=>3, 20=>3,
  21=>3, 22=>3, 23=>3, 24=>3, 25=>3, 26=>3, 27=>3, 28=>3, 29=>3, 30=>3, 31=>3, 
  32=>3, 33=>3, 34=>3, 35=>3, 36=>3, 37=>3, 38=>3, 39=>3, 40=>3, 41=>3, 42=>3, 
  43=>3, 44=>3, 45=>3, 46=>3, 47=>3, 48=>3, 49=>3, 50=>3, 51=>3, 52=>3, 53=>3,
  54=>3, 55=>3, 56=>3, 57=>3, 58=>3, 59=>3, 60=>3, 61=>3, 62=>3, 63=>3, 64=>3,
  65=>3, 66=>3, 67=>3, 68=>3,}  
  AFNTY[5] = {1=>3, 2=>3, 3=>3, 4=>3, 5=>3, 6=>3, 7=>3, 8=>3, 9=>3, 10=>3,
  11=>3, 12=>3, 13=>3, 14=>3, 15=>3, 16=>3, 17=>3, 18=>3, 19=>3, 20=>3,
  21=>3, 22=>3, 23=>3, 24=>3, 25=>3, 26=>3, 27=>3, 28=>3, 29=>3, 30=>3, 31=>3, 
  32=>3, 33=>3, 34=>3, 35=>3, 36=>3, 37=>3, 38=>3, 39=>3, 40=>3, 41=>3, 42=>3, 
  43=>3, 44=>3, 45=>3, 46=>3, 47=>3, 48=>3, 49=>3, 50=>3, 51=>3, 52=>3, 53=>3,
  54=>3, 55=>3, 56=>3, 57=>3, 58=>3, 59=>3, 60=>3, 61=>3, 62=>3, 63=>3, 64=>3,
  65=>3, 66=>3, 67=>3, 68=>3,}  
  AFNTY[6] = {1=>3, 2=>3, 3=>3, 4=>3, 5=>3, 6=>3, 7=>3, 8=>3, 9=>3, 10=>3,
  11=>3, 12=>3, 13=>3, 14=>3, 15=>3, 16=>3, 17=>3, 18=>3, 19=>3, 20=>3,
  21=>3, 22=>3, 23=>3, 24=>3, 25=>3, 26=>3, 27=>3, 28=>3, 29=>3, 30=>3, 31=>3, 
  32=>3, 33=>3, 34=>3, 35=>3, 36=>3, 37=>3, 38=>3, 39=>3, 40=>3, 41=>3, 42=>3, 
  43=>3, 44=>3, 45=>3, 46=>3, 47=>3, 48=>3, 49=>3, 50=>3, 51=>3, 52=>3, 53=>3,
  54=>3, 55=>3, 56=>3, 57=>3, 58=>3, 59=>3, 60=>3, 61=>3, 62=>3, 63=>3, 64=>3,
  65=>3, 66=>3, 67=>3, 68=>3,}  
  AFNTY[7] = {1=>3, 2=>3, 3=>3, 4=>3, 5=>3, 6=>3, 7=>3, 8=>3, 9=>3, 10=>3,
  11=>3, 12=>3, 13=>3, 14=>3, 15=>3, 16=>3, 17=>3, 18=>3, 19=>3, 20=>3,
  21=>3, 22=>3, 23=>3, 24=>3, 25=>3, 26=>3, 27=>3, 28=>3, 29=>3, 30=>3, 31=>3, 
  32=>3, 33=>3, 34=>3, 35=>3, 36=>3, 37=>3, 38=>3, 39=>3, 40=>3, 41=>3, 42=>3, 
  43=>3, 44=>3, 45=>3, 46=>3, 47=>3, 48=>3, 49=>3, 50=>3, 51=>3, 52=>3, 53=>3,
  54=>3, 55=>3, 56=>3, 57=>3, 58=>3, 59=>3, 60=>3, 61=>3, 62=>3, 63=>3, 64=>3,
  65=>3, 66=>3, 67=>3, 68=>3,}  
  AFNTY[8] = {1=>3, 2=>3, 3=>3, 4=>3, 5=>3, 6=>3, 7=>3, 8=>3, 9=>3, 10=>3,
  11=>3, 12=>3, 13=>3, 14=>3, 15=>3, 16=>3, 17=>3, 18=>3, 19=>3, 20=>3,
  21=>3, 22=>3, 23=>3, 24=>3, 25=>3, 26=>3, 27=>3, 28=>3, 29=>3, 30=>3, 31=>3, 
  32=>3, 33=>3, 34=>3, 35=>3, 36=>3, 37=>3, 38=>3, 39=>3, 40=>3, 41=>3, 42=>3, 
  43=>3, 44=>3, 45=>3, 46=>3, 47=>3, 48=>3, 49=>3, 50=>3, 51=>3, 52=>3, 53=>3,
  54=>3, 55=>3, 56=>3, 57=>3, 58=>3, 59=>3, 60=>3, 61=>3, 62=>3, 63=>3, 64=>3,
  65=>3, 66=>3, 67=>3, 68=>3,}  
  AFNTY[9] = {1=>3, 2=>3, 3=>3, 4=>3, 5=>3, 6=>3, 7=>3, 8=>3, 9=>3, 10=>3,
  11=>3, 12=>3, 13=>3, 14=>3, 15=>3, 16=>3, 17=>3, 18=>3, 19=>3, 20=>3,
  21=>3, 22=>3, 23=>3, 24=>3, 25=>3, 26=>3, 27=>3, 28=>3, 29=>3, 30=>3, 31=>3, 
  32=>3, 33=>3, 34=>3, 35=>3, 36=>3, 37=>3, 38=>3, 39=>3, 40=>3, 41=>3, 42=>3, 
  43=>3, 44=>3, 45=>3, 46=>3, 47=>3, 48=>3, 49=>3, 50=>3, 51=>3, 52=>3, 53=>3,
  54=>3, 55=>3, 56=>3, 57=>3, 58=>3, 59=>3, 60=>3, 61=>3, 62=>3, 63=>3, 64=>3,
  65=>3, 66=>3, 67=>3, 68=>3,}  
  AFNTY[10] = {1=>3, 2=>3, 3=>3, 4=>3, 5=>3, 6=>3, 7=>3, 8=>3, 9=>3, 10=>3,
  11=>3, 12=>3, 13=>3, 14=>3, 15=>3, 16=>3, 17=>3, 18=>3, 19=>3, 20=>3,
  21=>3, 22=>3, 23=>3, 24=>3, 25=>3, 26=>3, 27=>3, 28=>3, 29=>3, 30=>3, 31=>3, 
  32=>3, 33=>3, 34=>3, 35=>3, 36=>3, 37=>3, 38=>3, 39=>3, 40=>3, 41=>3, 42=>3, 
  43=>3, 44=>3, 45=>3, 46=>3, 47=>3, 48=>3, 49=>3, 50=>3, 51=>3, 52=>3, 53=>3,
  54=>3, 55=>3, 56=>3, 57=>3, 58=>3, 59=>3, 60=>3, 61=>3, 62=>3, 63=>3, 64=>3,
  65=>3, 66=>3, 67=>3, 68=>3,}
  AFNTY[11] = {1=>3, 2=>3, 3=>3, 4=>3, 5=>3, 6=>3, 7=>3, 8=>3, 9=>3, 10=>3,
  11=>3, 12=>3, 13=>3, 14=>3, 15=>3, 16=>3, 17=>3, 18=>3, 19=>3, 20=>3,
  21=>3, 22=>3, 23=>3, 24=>3, 25=>3, 26=>3, 27=>3, 28=>3, 29=>3, 30=>3, 31=>3, 
  32=>3, 33=>3, 34=>3, 35=>3, 36=>3, 37=>3, 38=>3, 39=>3, 40=>3, 41=>3, 42=>3, 
  43=>3, 44=>3, 45=>3, 46=>3, 47=>3, 48=>3, 49=>3, 50=>3, 51=>3, 52=>3, 53=>3,
  54=>3, 55=>3, 56=>3, 57=>3, 58=>3, 59=>3, 60=>3, 61=>3, 62=>3, 63=>3, 64=>3,
  65=>3, 66=>3, 67=>3, 68=>3,}
  AFNTY[22] = {1=>0, 2=>0, 3=>0, 4=>0, 5=>0, 6=>0, 7=>0, 8=>0, 9=>0, 10=>0,
  11=>0, 12=>0, 13=>0, 14=>0, 15=>0, 16=>0, 17=>0, 18=>0, 19=>0, 20=>0,
  21=>0, 22=>0, 23=>0, 24=>0, 25=>0, 26=>0, 27=>0, 28=>0, 29=>0, 30=>0, 31=>0, 
  32=>0, 33=>0, 34=>0, 35=>0, 36=>0, 37=>0, 38=>0, 39=>0, 40=>0, 41=>0, 42=>0, 
  43=>0, 44=>0, 45=>0, 46=>0, 47=>0, 48=>0, 49=>0, 50=>0, 51=>0, 52=>0, 53=>0,
  54=>0, 55=>0, 56=>0, 57=>0, 58=>0, 59=>0, 60=>0, 61=>0, 62=>0, 63=>0, 64=>0,
  65=>0, 66=>0, 67=>0, 68=>0,}
  
  # Для всех актёров партнёрство с духами запрещено

  
### Настройка уровня духов ####################################################
  # Включить повышение уровня
  USE_LV = false

  # Цель получения опыта
  #   0 : только у партнёров боевых членов
  #   1 : только у партнёров всех членов
  #   2 : у всех духов
  EXP_TARGET = 0

  # Тип получения опыта
  #   0 : повышение уровня по числу боёв
  #   1 : тот же опыт, что и у актёра
  EXP_TYPE = 1


### Настройка пороговых значений ##############################################
  # Пороговые значения для каждой характеристики
  # Добавочный параметр = параметр из БД - PRM_BASE
  PRM_BASE = [
    1,   # Макс. HP
    1,   # Макс. MP
    1,   # Атака
    1,   # Защита
    1,   # Магия
    1,   # Маг. защита
    1,   # Ловкость
    1    # Удача
  ]


### Настройки отображения на экране статуса ##################################
  # Отображаемые разделы и порядок (сверху вниз)
  STS = {
    :status => false,   # Статус (с уровнем)
    :stskl  => false,   # Статус (без уровня)
    :skills => false,   # Изученные навыки
    :feater => true     # Особенности
  }


### Настройки отображения на экране смены партнёров ##########################
  # Отображаемые разделы и порядок (сверху вниз)
  SHOW_ST = {
    :text   => true,   # Описание
    :status => false,   # Характеристики
    :skills => false,   # Изученные навыки
    :rate   => false,   # Сопротивления (элементы, ослабления, состояния, иммунитеты)
    :param  => false,   # Параметры (основные, дополнительные, специальные)
    :attack => false,   # Атака (элементы, состояния, скорость, количество ударов)
    :skill  => false,   # Навыки (добавление/запечатывание типов, добавление/запечатывание навыков)
    :equip  => false,   # Экипировка (типы оружия/брони, фиксация, запечатывание, тип слотов)
    :other  => false    # Прочее (дополнительные действия, спец. флаги, способности отряда)
  }

  # Количество колонок при отображении навыков (1-2)
  SKILL_NUM = 1
  
end


#==============================================================================
# ■ Spirits
#==============================================================================
module Spirits
  #--------------------------------------------------------------------------
  # ● Сделать духа партнёром
  #--------------------------------------------------------------------------
  def self.add_partner(actor_id, spirit_id)
    return unless $game_party.include_spirit?(spirit_id)
    return unless $game_actors[actor_id].can_join_partner(spirit_id)
    s_act_id = self.actor_id(spirit_id)
    return unless $game_actors[s_act_id].can_join_partner(actor_id)
    $game_actors[actor_id].add_partner(spirit_id)
    $game_actors[s_act_id].add_partner(actor_id)
  end
  #--------------------------------------------------------------------------
  # ● Отвязать духа-партнёра
  #--------------------------------------------------------------------------
  def self.remove_partner(actor_id, spirit_id)
    $game_actors[actor_id].remove_partner(spirit_id)
    $game_actors[self.actor_id(spirit_id)].remove_partner(actor_id)
  end
  #--------------------------------------------------------------------------
  # ● Зафиксировать партнёра (нельзя отвязать)
  #--------------------------------------------------------------------------
  def self.lock_partner(spirit_id)
    spirit = $game_actors[self.actor_id(spirit_id)]
    return unless spirit.has_partner?
    spirit.lock_partner
  end
  #--------------------------------------------------------------------------
  # ● Отменить фиксацию партнёра
  #--------------------------------------------------------------------------
  def self.unlock_partner(spirit_id)
    spirit = $game_actors[self.actor_id(spirit_id)]
    return unless spirit.has_partner?
    spirit.unlock_partner
  end
  #--------------------------------------------------------------------------
  # ● Является ли актёр духом?
  #--------------------------------------------------------------------------
  def self.spirit?(actor_id)
    SPIRIT_ACTOR.has_value?(actor_id)
  end
  #--------------------------------------------------------------------------
  # ● ID духа => ID актёра
  #--------------------------------------------------------------------------
  def self.actor_id(spirit_id)
    SPIRIT_ACTOR[spirit_id].nil? ? 0 : SPIRIT_ACTOR[spirit_id]
  end
  #--------------------------------------------------------------------------
  # ● ID актёра => ID духа
  #--------------------------------------------------------------------------
  def self.spirit_id(actor_id)
    id = SPIRIT_ACTOR.index(actor_id)
    id.nil? ? 0 : id
  end
  #--------------------------------------------------------------------------
  # ● Максимальное количество партнёров
  #--------------------------------------------------------------------------
  def self.max(actor_id)
    MAX[actor_id].nil? ? MAX[0] : MAX[actor_id]
  end
  #--------------------------------------------------------------------------
  # ● Совместимость
  #--------------------------------------------------------------------------
  def self.affinity(actor_id, spirit_id)
    if AFNTY[actor_id].nil?
      return AFNTY[0][0]
    elsif AFNTY[actor_id][spirit_id].nil?
      return AFNTY[actor_id][0].nil? ? AFNTY[0][0] : AFNTY[actor_id][0]
    else
      return AFNTY[actor_id][spirit_id]
    end
  end
  #--------------------------------------------------------------------------
  # ● Расчёт характеристики с учётом совместимости
  #--------------------------------------------------------------------------
  def self.affinity_param(param, actor_id, spirit_id)
    prm = [0, 0.5, 0.8, 1.0, 1.2, 1.5]  # коэффициент совместимости
    n = affinity(actor_id, spirit_id)
    p "[#{actor_id}, #{spirit_id}] => #{n}" if n.nil?
    (param * prm[affinity(actor_id, spirit_id)]).truncate
  end
  #--------------------------------------------------------------------------
  # ● Активные разделы в окне статуса
  #--------------------------------------------------------------------------
  def self.sts
    STS.select {|key, v| v}.keys
  end
  #--------------------------------------------------------------------------
  # ● Активные разделы в окне смены партнёров
  #--------------------------------------------------------------------------
  def self.status
    SHOW_ST.select {|key, v| v}.keys
  end
end


#==============================================================================
# ■ Spirits::Features      : Извлечение информации об особенностях
#==============================================================================
class Spirits::Features
  #--------------------------------------------------------------------------
  # ● Константы (особенности)
  #--------------------------------------------------------------------------
  FEATURE_ELEMENT_RATE  = 11              # Эффективность элемента
  FEATURE_DEBUFF_RATE   = 12              # Эффективность ослабления
  FEATURE_STATE_RATE    = 13              # Эффективность состояния
  FEATURE_STATE_RESIST  = 14              # Иммунитет к состоянию
  FEATURE_PARAM         = 21              # Основные параметры
  FEATURE_XPARAM        = 22              # Дополнительные параметры
  FEATURE_SPARAM        = 23              # Специальные параметры
  FEATURE_ATK_ELEMENT   = 31              # Элемент атаки
  FEATURE_ATK_STATE     = 32              # Состояние при атаке
  FEATURE_ATK_SPEED     = 33              # Коррекция скорости атаки
  FEATURE_ATK_TIMES     = 34              # Дополнительные атаки
  FEATURE_STYPE_ADD     = 41              # Добавление типа навыка
  FEATURE_STYPE_SEAL    = 42              # Запечатывание типа навыка
  FEATURE_SKILL_ADD     = 43              # Добавление навыка
  FEATURE_SKILL_SEAL    = 44              # Запечатывание навыка
  FEATURE_EQUIP_WTYPE   = 51              # Экипировка оружия
  FEATURE_EQUIP_ATYPE   = 52              # Экипировка брони
  FEATURE_EQUIP_FIX     = 53              # Фиксация экипировки
  FEATURE_EQUIP_SEAL    = 54              # Запечатывание слота экипировки
  FEATURE_SLOT_TYPE     = 55              # Тип слотов
  FEATURE_ACTION_PLUS   = 61              # Дополнительные действия
  FEATURE_SPECIAL_FLAG  = 62              # Специальные флаги
  FEATURE_COLLAPSE_TYPE = 63              # Эффект исчезновения
  FEATURE_PARTY_ABILITY = 64              # Способности отряда
  #--------------------------------------------------------------------------
  # ● Константы способностей отряда
  #--------------------------------------------------------------------------
  ABILITY_ENCOUNTER_HALF    = 0           # Половина случайных встреч
  ABILITY_ENCOUNTER_NONE    = 1           # Нет случайных встреч
  ABILITY_CANCEL_SURPRISE   = 2           # Отмена внезапных атак
  ABILITY_RAISE_PREEMPTIVE  = 3           # Повышение шанса превентивной атаки
  ABILITY_GOLD_DOUBLE       = 4           # Двойное золото
  ABILITY_DROP_ITEM_DOUBLE  = 5           # Двойной шанс выпадения предметов
  #--------------------------------------------------------------------------
  # ● Инициализация объекта
  #--------------------------------------------------------------------------
  def initialize(spirit)
    @obj = spirit
  end
  #--------------------------------------------------------------------------
  # ● Сопротивление элементам
  #--------------------------------------------------------------------------
  def element_rate
    fts = @obj.features(FEATURE_ELEMENT_RATE)
    fts.collect {|ft| ["#{$data_system.elements[ft.data_id]} – Сопротивление", sprintf("%d %%", ft.value)] }
  end
  #--------------------------------------------------------------------------
  # ● Сопротивление ослаблениям
  #--------------------------------------------------------------------------
  def debuff_rate
    fts = @obj.features(FEATURE_DEBUFF_RATE)
    fts.collect {|ft| ["#{$data_system.terms.params[ft.data_id]} – Сопротивление ослаблению", sprintf("%d %%", ft.value)] }
  end
  #--------------------------------------------------------------------------
  # ● Сопротивление состояниям
  #--------------------------------------------------------------------------
  def state_rate
    fts = @obj.features(FEATURE_STATE_RATE)
    fts.collect {|ft| ["#{$data_states[ft.data_id].name} – Сопротивление", sprintf("%d %%", ft.value)] }
  end
  #--------------------------------------------------------------------------
  # ● Иммунитет к состояниям
  #--------------------------------------------------------------------------
  def state_regist
    fts = @obj.features(FEATURE_STATE_RESIST)
    fts.collect {|ft| ["#{$data_states[ft.data_id].name} – Иммунитет", nil] }
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о сопротивлениях
  #--------------------------------------------------------------------------
  def rate
    element_rate + debuff_rate + state_rate + state_regist
  end
  #--------------------------------------------------------------------------
  # ● Получение информации об основных параметрах
  #--------------------------------------------------------------------------
  def nparam
    fts = @obj.features(FEATURE_PARAM)
    fts.collect {|ft| ["#{$data_system.terms.params[ft.data_id]}", sprintf("%+d %%", ft.value)] }
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о дополнительных параметрах
  #--------------------------------------------------------------------------
  def xparam
    txt = ["Точность", "Уклонение", "Шанс крита", "Уклонение от крита",
           "Уклонение от магии", "Отражение магии", "Контратака",
           "Регенерация HP",
           "Регенерация MP",
           "Регенерация TP"]
    fts = @obj.features(FEATURE_XPARAM)
    fts.collect {|ft| ["#{txt[ft.data_id]}", sprintf("%+d %%", ft.value)] }
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о специальных параметрах
  #--------------------------------------------------------------------------
  def sparam
    txt = ["Вероятность быть целью", "Эффективность защиты", "Эффективность лечения", "Знание лекарств",
           "Стоимость MP", 
           "Заряд TP",
           "Физ. урон", "Маг. урон", "Урон от пола", "Получение опыта"]
    fts = @obj.features(FEATURE_SPARAM)
    fts.collect {|ft| ["#{$data_system.terms.params[ft.data_id]}", sprintf("%+d %%", ft.value)] }
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о параметрах (объединение)
  #--------------------------------------------------------------------------
  def param
    nparam + xparam + sparam
  end
  #--------------------------------------------------------------------------
  # ● Получение информации об элементах атаки
  #--------------------------------------------------------------------------
  def atk_element
    fts = @obj.features(FEATURE_ATK_ELEMENT)
    fts.collect {|ft| ["Элемент атаки", $data_system.elements[ft.data_id]] }
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о состояниях при атаке
  #--------------------------------------------------------------------------
  def atk_state
    fts = @obj.features(FEATURE_ATK_STATE)
    fts.collect {|ft| ["Состояние при атаке", $data_states[ft.data_id].name] }
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о коррекции скорости атаки
  #--------------------------------------------------------------------------
  def atk_speed
    fts = @obj.features(FEATURE_ATK_SPEED)
    fts.collect {|ft| ["Скорость атаки", ft.value.to_s] }
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о количестве атак
  #--------------------------------------------------------------------------
  def atk_times
    fts = @obj.features(FEATURE_ATK_TIMES)
    fts.collect {|ft| ["#{ft.value} атак(и)", nil] }
  end
  #--------------------------------------------------------------------------
  # ● Получение информации об атаке (объединение)
  #--------------------------------------------------------------------------
  def attack
    atk_element + atk_state + atk_speed + atk_times
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о добавленных типах навыков
  #--------------------------------------------------------------------------
  def skill_add_type
    fts = @obj.features(FEATURE_STYPE_ADD)
    fts.collect {|ft| ["Тип «#{$data_system.skill_types[ft.data_id]}» добавлен", nil] }
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о запечатанных типах навыков
  #--------------------------------------------------------------------------
  def skill_seal_type
    fts = @obj.features(FEATURE_STYPE_SEAL)
    fts.collect {|ft| ["Тип «#{$data_system.skill_types[ft.data_id]}» запечатан", nil] }
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о добавленных навыках
  #--------------------------------------------------------------------------
  def skill_add
    fts = @obj.features(FEATURE_SKILL_ADD)
    fts.collect {|ft| ["Навык «#{$data_skills[ft.data_id].name}» добавлен", nil] }
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о запечатанных навыках
  #--------------------------------------------------------------------------
  def skill_seal
    fts = @obj.features(FEATURE_SKILL_SEAL)
    fts.collect {|ft| ["Навык «#{$data_skills[ft.data_id].name}» запечатан", nil] }
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о навыках (объединение)
  #--------------------------------------------------------------------------
  def skill
    skill_add_type + skill_seal_type # + skill_add + skill_seal
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о типах экипируемого оружия
  #--------------------------------------------------------------------------
  def equip_wtype
    fts = @obj.features(FEATURE_EQUIP_WTYPE)
    fts.collect {|ft| ["Тип оружия «#{$data_system.weapon_types[ft.data_id]}» доступен", nil] }
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о типах экипируемой брони
  #--------------------------------------------------------------------------
  def equip_atype
    fts = @obj.features(FEATURE_EQUIP_ATYPE)
    fts.collect {|ft| ["Тип брони «#{$data_system.armor_types[ft.data_id]}» доступен", nil] }
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о фиксации экипировки
  #--------------------------------------------------------------------------
  def equip_fix
    fts = @obj.features(FEATURE_EQUIP_FIX)
    fts.collect {|ft| ["Слот «#{$data_system.terms.etypes[ft.data_id]}» зафиксирован", nil] }
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о запечатывании слотов экипировки
  #--------------------------------------------------------------------------
  def equip_seal
    fts = @obj.features(FEATURE_EQUIP_SEAL)
    fts.collect {|ft| ["Слот «#{$data_system.terms.etypes[ft.data_id]}» запечатан", nil] }
  end
  #--------------------------------------------------------------------------
  # ● Получение информации об экипировке (объединение)
  #--------------------------------------------------------------------------
  def equip
    equip_wtype + equip_atype + equip_fix + equip_seal
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о дополнительных действиях
  #--------------------------------------------------------------------------
  def action_plus
    fts = @obj.features(FEATURE_ACTION_PLUS)
    fts.collect {|ft| ["#{ft.value} дополнительных действий", nil] }
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о специальных флагах
  #--------------------------------------------------------------------------
  def special_flag
    str = []
    str.push(["Автоматический бой", nil]) if @obj.auto_battle?
    str.push(["Автоматическая защита", nil]) if @obj.guard?
    str.push(["Замещение", nil]) if @obj.substitute?
    str.push(["Сохранение TP", nil]) if @obj.preserve_tp?
    str
  end
  #--------------------------------------------------------------------------
  # ● Получение информации о способностях отряда
  #--------------------------------------------------------------------------
  def party_ability
    fts = @obj.features(FEATURE_PARTY_ABILITY)
    str = []
    str.push(["Половина случайных встреч", nil])   if fts.any? {|ft| ft.data_id == ABILITY_ENCOUNTER_HALF }
    str.push(["Нет случайных встреч", nil])        if fts.any? {|ft| ft.data_id == ABILITY_ENCOUNTER_NONE }
    str.push(["Отмена внезапных атак", nil])       if fts.any? {|ft| ft.data_id == ABILITY_CANCEL_SURPRISE }
    str.push(["Повышение шанса превентивной атаки", nil]) if fts.any? {|ft| ft.data_id == ABILITY_RAISE_PREEMPTIVE }
    str.push(["Двойное золото", nil])              if fts.any? {|ft| ft.data_id == ABILITY_GOLD_DOUBLE }
    str.push(["Двойной шанс выпадения предметов", nil]) if fts.any? {|ft| ft.data_id == ABILITY_DROP_ITEM_DOUBLE }
    str
  end
  #--------------------------------------------------------------------------
  # ● Получение прочей информации
  #--------------------------------------------------------------------------
  def other
    action_plus + special_flag + party_ability
  end
  #--------------------------------------------------------------------------
  # ● Получение всех особенностей
  #--------------------------------------------------------------------------
  def all
    Spirits.status.inject([]) do |r, st|
      case st
      when :rate;   r += self.rate
      when :param;  r += self.param
      when :attack; r += self.attack
      when :skill;  r += self.skill
      when :equip;  r += self.equip
      when :other;  r += self.other
      end
    end
   end
end


#==============================================================================
# ■ Game_Actor
#==============================================================================
class Game_Actor < Game_Battler
  attr_reader :max_spirits        # Максимальное количество духов
  attr_reader :partner_locked     # Зафиксирован ли партнёр
  #--------------------------------------------------------------------------
  # ● Настройка
  #--------------------------------------------------------------------------
  alias setup_spirit setup
  def setup(actor_id)
    @partners = []
    @max_spirits = Spirits.max(actor_id)
    @parent_id = 0
    @partner_locked = false
    @is_spirit = Spirits.spirit?(actor_id)
    setup_spirit(actor_id)
  end
  #--------------------------------------------------------------------------
  # ● Является ли духом?
  #--------------------------------------------------------------------------
  def spirit?
    @is_spirit
  end
  #--------------------------------------------------------------------------
  # ● Изменить максимальное количество духов
  #--------------------------------------------------------------------------
  def max_spirits=(num)
    @max_spirits = [1, num].max unless spirit?
  end
  #--------------------------------------------------------------------------
  # ● ID духа (если сам дух)
  #--------------------------------------------------------------------------
  def spirit_id
    spirit? ? Spirits.spirit_id(@actor_id) : 0
  end
  #--------------------------------------------------------------------------
  # ● Можно ли добавить духа?
  #--------------------------------------------------------------------------
  def can_partner(spirit_id)
    spirit? ? false : (Spirits.affinity(@actor_id, spirit_id) != 0)
  end
  #--------------------------------------------------------------------------
  # ● Можно ли сменить духа?
  #--------------------------------------------------------------------------
  def can_change_partner(index)
    return false if spirit?
    return true  if @partners[index] == 0
    $game_actors[@partners[index]].partner_locked
  end
  #--------------------------------------------------------------------------
  # ● Можно ли присоединить партнёра?
  #--------------------------------------------------------------------------
  def can_join_partner(partner_id=0)
    return (@parent_id == 0) if spirit?
    return false unless can_partner(partner_id)
    (@partners.size < @max_spirits)
  end
  #--------------------------------------------------------------------------
  # ● Добавить партнёра
  #--------------------------------------------------------------------------
  def add_partner(partner_id)
    if spirit?
      @parent_id = partner_id
    else
      return if @max_spirits == partner_num
      @partners.push(partner_id) unless @partners.include?(partner_id)
    end
  end
  #--------------------------------------------------------------------------
  # ● Удалить партнёра
  #--------------------------------------------------------------------------
  def remove_partner(partner_id)
    if spirit?
      @parent_id = 0
      unlock_partner
    else
      @partners.delete(partner_id)
    end
  end
  #--------------------------------------------------------------------------
  # ● Сменить партнёра
  #--------------------------------------------------------------------------
  def change_partner(partner_id, index=0)
    if spirit?
      @parent_id = partner_id
    else
      @partners[index] = partner_id
    end
  end
  #--------------------------------------------------------------------------
  # ● Временная смена партнёра для расчёта параметра
  #--------------------------------------------------------------------------
  def v_chg_param(partner_id, index, param_id)
    return 0 if spirit?
    now_partner = @partners[index]
    change_partner(partner_id, index)
    prm = self.param(param_id)
    change_partner(now_partner, index)
    prm
  end
  #--------------------------------------------------------------------------
  # ● Есть ли партнёр?
  #--------------------------------------------------------------------------
  def has_partner?
    spirit? ? (@parent_id != 0) : (!@partners.empty?)
  end
  def has_spirit?
    spirit? ? false : (!@partners.empty?)
  end
  #--------------------------------------------------------------------------
  # ● Зафиксировать партнёра (нельзя отвязать)
  #--------------------------------------------------------------------------
  def lock_partner
    return unless spirit?
    @partner_locked = true
  end
  #--------------------------------------------------------------------------
  # ● Отменить фиксацию партнёра
  #--------------------------------------------------------------------------
  def unlock_partner
    @partner_locked = false
  end
  #--------------------------------------------------------------------------
  # ● Список партнёров
  #--------------------------------------------------------------------------
  def partners
    return (has_partner? ? [$game_actors[@parent_id]] : []) if spirit?
    @partners.collect {|id| id.nil? ? nil : $game_actors[Spirits.actor_id(id)]}
  end
  def partners_objs
    partners.compact
  end
  #--------------------------------------------------------------------------
  # ● Количество партнёров
  #--------------------------------------------------------------------------
  def partner_num
    @partners.size
  end
  #--------------------------------------------------------------------------
  # ● Получение дополнительных навыков
  #--------------------------------------------------------------------------
  def added_skills
    has_spirit? ? partners_objs.inject(super) {|r, s| r |= s.skillids} : super
  end
  #--------------------------------------------------------------------------
  # ● Получение ID навыков
  #--------------------------------------------------------------------------
  def skillids
    @skills
  end
  #--------------------------------------------------------------------------
  # ● Получение основного параметра (без учёта базы духа)
  #--------------------------------------------------------------------------
  def param(param_id)
    super(param_id) - (spirit? ? Spirits::PRM_BASE[param_id] : 0)
  end
  alias org_param param
  def param(param_id)
    org = org_param(param_id)
    if has_spirit?
      partners_objs.each do |s|
        org += Spirits.affinity_param(s.org_param(param_id), @actor_id, s.spirit_id)
      end
    end
    org
  end
  #--------------------------------------------------------------------------
  # ● Получение всех объектов с особенностями
  #--------------------------------------------------------------------------
  alias org_feature_objects feature_objects
  def feature_objects
    org = org_feature_objects
    partners_objs.collect {|s| s.org_feature_objects }.each {|obj| org += obj} if has_spirit?
    org
  end
  #--------------------------------------------------------------------------
  # ● Коэффициент получения опыта запасными членами
  #--------------------------------------------------------------------------
  alias reserve_members_exp_rate_spirits reserve_members_exp_rate
  def reserve_members_exp_rate
    spirit? ? 1 : reserve_members_exp_rate_spirits
  end
end


#==============================================================================
# ■ Game_Party
#==============================================================================
class Game_Party < Game_Unit
  #--------------------------------------------------------------------------
  # ● Инициализация объекта
  #--------------------------------------------------------------------------
  alias initialize_spirits initialize
  def initialize
    @spirits = []
    initialize_spirits
  end
  #--------------------------------------------------------------------------
  # ● Настройка начального состава партии
  #--------------------------------------------------------------------------
  alias setup_starting_members_spirits setup_starting_members
  def setup_starting_members
    setup_starting_members_spirits
    setup_starting_spirits
  end
  #--------------------------------------------------------------------------
  # ● Настройка начальных партнёров
  #--------------------------------------------------------------------------
  def setup_starting_spirits
    remeve_all_spirit
    @spirits = Spirits::START_V
    Spirits::START_P.each_pair do |aid, sid|
      if @actors.include?(aid) and @spirits.include?(sid)
        $game_actors[aid].add_partner(sid)
        $game_actors[Spirits.actor_id(sid)].add_partner(aid)
        $game_actors[aid].recover_all
      else
        p "START_P[#{aid} => #{sid}] is bad arg."
      end
    end
  end
  #--------------------------------------------------------------------------
  # ● Есть ли дух?
  #--------------------------------------------------------------------------
  def include_spirit?(spirit_id)
    @spirits.include?(spirit_id)
  end
  #--------------------------------------------------------------------------
  # ● Добавить духа
  #--------------------------------------------------------------------------
  def add_spirit(spirit_id)
    @spirits.push(spirit_id) unless include_spirit?(spirit_id)
  end
  #--------------------------------------------------------------------------
  # ● Удалить духа
  #--------------------------------------------------------------------------
  def remove_spirit(spirit_id)
    members.each {|actor| actor.remove_partner(spirit_id)}
    @spirits.delete(spirit_id)
  end
  #--------------------------------------------------------------------------
  # ● Удалить всех духов
  #--------------------------------------------------------------------------
  def remeve_all_spirit
    @spirits.each {|id| members.each {|actor| actor.remove_partner(id)}}
    @spirits = []
  end
  #--------------------------------------------------------------------------
  # ● Список духов
  #--------------------------------------------------------------------------
  def spirit_members
    @spirits.collect {|id| spirit(id)}
  end
  #--------------------------------------------------------------------------
  # ● Список духов без партнёра (ожидающие)
  #--------------------------------------------------------------------------
  def spirit_stay_members
    spirit_members.select {|spirit| !spirit.has_partner?}
  end
  #--------------------------------------------------------------------------
  # ● Количество духов
  #--------------------------------------------------------------------------
  def spirit_num
    @spirits.size
  end
  #--------------------------------------------------------------------------
  # ● Данные духа
  #--------------------------------------------------------------------------
  def spirit(spirit_id)
    $game_actors[Spirits.actor_id(spirit_id)]
  end
end



#==============================================================================
# ■ Window_Base
#==============================================================================
class Window_Base < Window
  #--------------------------------------------------------------------------
  # ● Отрисовка спрайта персонажа
  #--------------------------------------------------------------------------
  def draw_line_character(character_name, character_index, x, y, enabled=true)
    return unless character_name
    bitmap = Cache.character(character_name)
    sign = character_name[/^[\!\$]./]
    if sign && sign.include?('$')
      cw = bitmap.width / 3
      ch = bitmap.height / 4
    else
      cw = bitmap.width / 12
      ch = bitmap.height / 8
    end
    y += (line_height - ch) / 2 if ch < line_height
    n = character_index
    src_rect = Rect.new((n%4*3+1)*cw, (n/4*4)*ch, cw, [ch, line_height].min)
    contents.blt(x, y, bitmap, src_rect, enabled ? 255 : translucent_alpha)
    cw
  end
  #--------------------------------------------------------------------------
  # ● Отрисовка спрайта актёра
  #--------------------------------------------------------------------------
  def draw_actor_line_graphic(actor, x, y, enabled=true)
    draw_line_character(actor.character_name, actor.character_index, x, y, enabled)
  end
  #--------------------------------------------------------------------------
  # ● Отрисовка имени партнёра
  #--------------------------------------------------------------------------
  def draw_partner_name(actor, x, y)
    change_color(system_color)
    draw_text(x, y, contents_width, line_height, actor.spirit? ? "Партнёр" : "Связь")
    x += 100
    change_color(normal_color)
    if actor.has_partner?
      actor.partners.each_with_index {|s, i| draw_actor_line_graphic(s, x + 48 * i, y)}
    else
      draw_text(x, y, contents_width, line_height, "———")
    end
  end
  #--------------------------------------------------------------------------
  # ● Отрисовка имени духа
  #--------------------------------------------------------------------------
  def draw_spirit_name(actor, x, y, enabled=true, width = 112)
    change_color(normal_color, enabled)
    draw_text(x, y, width, line_height, actor.name)
  end
  #--------------------------------------------------------------------------
  # ● Отрисовка параметра
  #--------------------------------------------------------------------------
  def draw_spirit_param(actor, x, y, param_id)
    change_color(system_color)
    draw_text(x, y, 120, line_height, Vocab::param(param_id))
    prm = actor.param(param_id)
    change_color(param_change_color(prm))
    if prm == 0
      draw_text(x + 100, y, 56, line_height, "----", 2)
    else
      draw_text(x + 100, y, 56, line_height, sprintf("%+d", prm), 2)
    end
  end
end


class << BattleManager
  #--------------------------------------------------------------------------
  # ● Получение опыта и отображение повышения уровня
  #--------------------------------------------------------------------------
  alias gain_exp_spirits gain_exp
  def gain_exp
    gain_exp_spirits
    gain_spirit_exp if Spirits::USE_LV
  end
  #--------------------------------------------------------------------------
  # ● Получение опыта духами
  #--------------------------------------------------------------------------
  def gain_spirit_exp
    case Spirits::EXP_TARGET
    when 0
      $game_party.battle_members.each do |actor|
        actor.partners.compact.each do |spirit|
          spirit.gain_exp(spirit_exp)
        end
      end
    when 1
      $game_party.all_members.each do |actor|
        actor.partners.compact.each do |spirit|
          spirit.gain_exp(spirit_exp)
        end
      end
    when 2
      $game_party.spirit_members.each do |spirit|
        spirit.gain_exp(spirit_exp)
      end
    end
    wait_for_message
  end
  #--------------------------------------------------------------------------
  # ● Опыт для духов
  #--------------------------------------------------------------------------
  def spirit_exp
    Spirits::EXP_TYPE == 0 ? 1 : $game_troop.exp_total
  end
end


if defined?(BtlrFv)
class << BattleManager
  #--------------------------------------------------------------------------
  # ● Отображение полученного опыта
  #--------------------------------------------------------------------------
  alias display_result_spirit display_result
  def display_result
    display_result_spirit
    gain_spirit_exp if Spirits::USE_LV
  end
end
end # BtlrFv